---
kind: method
id: M:Autodesk.Revit.DB.RoofBase.GetSlabShapeEditor
source: html/54ffcdb1-aadf-4674-16e7-2f6d1ce215a5.htm
---
# Autodesk.Revit.DB.RoofBase.GetSlabShapeEditor Method

Gets a SlabShapeEditor that can used to add or modify points of this RoofBase.

## Syntax (C#)
```csharp
public SlabShapeEditor GetSlabShapeEditor()
```

## Returns
The SlabShapeEditor object